import pygame
from pygame.draw import *

pygame.init()

FPS=30
screen=pygame.display.set_mode((1200,750))
rect(screen, (240, 210, 140), (0, 0,  1200, 180)) # верхний фон
rect(screen, (240, 200, 200), (0, 180, 1200, 180)) # второй сверху
rect(screen, (255, 230, 175), (0, 360, 1200, 200)) # второй снизу
circle(screen, (255, 255, 0), (600, 180), 60) # солнце

# оранжевая гора
polygon(screen, (255, 135, 20), [(0, 350), (70, 310), (80, 309), (90, 308), (100, 307), (110, 305), (120, 302), (130, 299), (140, 295), (150, 291), (160, 286), (170, 281), (300, 180), (350, 200), (430, 290), (600, 260), (650, 305), (700, 240), (800, 280), (900, 250), (1000, 150), (1100, 250), (1200, 270)])
ellipse(screen, (255, 135, 20), (900, 200, 40, 70))

# коричневая гора
polygon(screen, (130, 40, 25), [(0, 400), (10, 400), (70, 420), (80, 600), (0, 600)])
polygon(screen, (130, 40, 25), [(100, 600), (300, 400), (420, 420), (440, 380), (600, 400), (650, 450), (700, 420), (900, 440), (980, 420), (1030, 450), (1080, 420), (1180, 440), (1200, 350), (1200, 530)])
ellipse(screen, (130, 40, 25), (50, 300, 175, 300))
ellipse(screen, (130, 40, 25), (730, 360, 200, 250))

polygon(screen, (220, 180, 240), [(0, 560), (0, 750), (1200, 750), (1200, 530)]) # нижний фон

pygame.display.update()
clock = pygame.time.Clock()
finished = False

while not finished:
    clock.tick(FPS)
    for event in pygame.event.get():
        if event.type == pygame.QUIT:
            finished = True

pygame.quit()
